package main

import "github.com/gin-gonic/gin"

var song = gin.H{
	"title":  "Hadal Ahsbek",
	"artist": "Hamaki",
	"lyrics": []string{
		"هدل أحسبك ناسي",
		"ولا قلبك قاسي",
		"ولا إيه اللي خلاك",
		"تبعد عني وتنساني",
		"",
		"هدل أحسبك ناسي",
		"ولا قلبك قاسي",
		"ولا إيه اللي خلاك",
		"تبعد عني وتنساني",
		"",
		"أنا مش عارف أعيش من غيرك",
		"وإنت بعيد عني",
		"ومش قادر أنسى عينيك",
		"وإنت بعيد عني",
		"",
		"يا حبيبي تعالى",
		"أنا محتاجلك أوي",
		"يا حبيبي تعالى",
		"أنا محتاجلك أوي",
		"",
		"هدل أحسبك ناسي",
		"ولا قلبك قاسي",
		"ولا إيه اللي خلاك",
		"تبعد عني وتنساني",
	},
}

func main() {
	r := gin.Default()

	r.GET("/song", func(c *gin.Context) {
		c.JSON(200, song)
	})

	r.Run(":8080")
}
